Repository: 84000/data-translation-memory
Catalog: toh257-v4.tmx
Source language: bo
Languages: en

source: །དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ནས་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་འདི་ཐམས་ཅད་དང་། གླིང་བཞི་པ་བྱེ་བ་ཕྲག་བརྒྱ་དང་། རིའི་རྒྱལ་པོ་རི་རབ་བྱེ་བ་ཕྲག་བརྒྱ་དང་། ཉི་མ་དང་ཟླ་བ་བྱེ་བ་ཕྲག་བརྒྱ་སྙེད་དང་། སྲིད་པའི་རྩེ་མོའི་ལྷའི་གནས་བྱེ་བ་ཕྲག་བརྒྱ་སྙེད་ཡོད་པ་དེ་དག་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་ཆུད་པར་ཡང་དག་པར་སྣང་ངོ་།
en: After the Blessed One had entered this absorption, the entire buddha realm of Sahā and all the trillions of worlds with their four continents, the trillions of Mount Sumerus, the trillions of suns and moons, and the trillions of divine abodes at the summit of existence appeared within the body of the Thus-Gone One.

source: །ཐམས་ཅད་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་གནས་པར་ཡང་དག་པར་སྣང་ངོ་། །
en: The entire buddha realm of Sahā appeared within the body of the Thus-Gone One.

source: སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་འདིར་གཏོགས་པའི་སེམས་ཅན་སེམས་ཅན་དམྱལ་བའམ། དུད་འགྲོའི་སྐྱེ་གནས་པའམ། གཤིན་རྗེའི་འཇིག་རྟེན་པའམ། ལྷའམ། མི་གང་དག་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱི་ལུས་དང་སེམས་ཀྱི་སྡུག་བསྔལ་གྱི་ཉོན་མོངས་པ་ཡང་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་རྒྱུན་ཆད་དོ། །དེ་དག་ཐམས་ཅད་ཀྱིས་ལུས་དང་སེམས་ཀྱི་བདེ་བ་འདི་ལྟ་བུ་ཐོབ་པར་གྱུར་ཏེ། དཔེར་ན་བསམ་གཏན་གཉིས་པའི་ཞི་གནས་ཐོབ་པའི་དགེ་སློང་སྙོམས་པར་ཞུགས་པ་བཞིན་ནོ།
en: All the afflictions related to the physical and mental suffering of all the sentient beings present in this buddha realm of Sahā—the hell beings, the animals, those in the World of the Lord of Death, the gods, and the humans—were completely eliminated, and they all achieved physical and mental well-being similar to that experienced by the monks who have entered into absorption and reached the tranquility of the second concentration.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་ཏིང་ངེ་འཛིན་ལས་ལངས་ཏེ་ལངས་པ་དེ་དག་ཐམས་ཅད་ཀྱི་རང་གི་ལུས་ལ་སྣང་བ་ནུབ་པར་གྱུར་ཏོ།
en: All the bodhisattvas then arose from their absorptions, and the light was dimmed within their bodies.

source: །ཉན་ཐོས་ཐམས་ཅད་དང་སེམས་ཅན་གང་སུ་དག་སྙོམས་པར་ཞུགས་པ་དེ་དག་ཐམས་ཅད་ཏིང་ངེ་འཛིན་ལས་ལངས་ཏེ། དེ་དག་ཐམས་ཅད་ལུས་དང་སེམས་ཀྱི་བདེ་བ་དེ་ལྟ་བུ་དང་ཡང་དག་ལྡན་པར་གྱུར་ཏོ།
en: All the hearers and sentient beings who had entered into absorption likewise arose from their absorptions and experienced such physical and mental well-being.

source: །དེ་དག་ཐམས་ཅད་ངོ་མཚར་ཐོབ་ཅིང་རྨད་དུ་བྱུང་བ་ཐོབ་སྟེ།
en: They were all amazed and astonished.

source: དབང་པོ་ཚིམ་ནས་དེ་དག་དེ་བཞིན་གཤེགས་པའི་སྐུའི་ནང་དུ་གནས་ཤིང་འཁོད་ནས་བཅོམ་ལྡན་འདས་ཀྱི་སྐུའི་བ་སྤུའི་ཁུང་བུ་ལ་བལྟས་ཏེ།
en: With their senses satisfied, they sat within the body of the Thus-Gone One and looked at the pores of the Blessed One’s body.

source: དེ་དག་ཐམས་ཅད་ཀྱིས་འདི་ལྟར་བཅོམ་ལྡན་འདས་ཀྱི་སྐུའི་བ་སྤུའི་ཁུང་བུ་གཅིག་ནས་འོད་ཟེར་འདི་ལྟ་བུ་བྱུང་བ་དེ་ལྟ་བུ་མཐོང་བར་གྱུར་ཏེ། དཔེར་ན་ཉི་མ་དང་ཟླ་བ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དང་། ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་སྣང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ས་བཅུ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་འོད་ཟེར་གྱི་སྣང་བ་བཞིན་ནོ།
en: They all saw that from one pore of the Blessed One’s body radiated light as bright as the light emitted by as many suns, moons, great precious gems, and tenth-level bodhisattvas as there are grains of sand in the Ganges River.

source: །བཅོམ་ལྡན་འདས་ཀྱི་བ་སྤུའི་ཁུང་བུ་རེ་རེ་ནས་ཀྱང་འོད་དེ་ལྟ་བུ་བྱུང་སྟེ།
en: Such was the light that radiated from each of the pores of the Blessed One.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་ལས་འོད་ཟེར་རབ་ཏུ་བྱུང་བ་དེ་དག་གིས་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་སྣང་བ་ཆེན་པོས་རྒྱས་པར་གང་བར་གྱུར་ཏོ།
en: The light emanating from the Blessed One’s body filled all the buddha realms of the ten directions with its brilliance.

source: །སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་པ་མ་ཡིན་པ་གང་དག་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་བཞུགས་ཤིང་གཞེས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དང་དེ་དག་གིས་ཐམས་ཅད་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་ཐམས་ཅད་འདི་ལྟ་བུའི་དབྱངས་བརྗོད་པས་ཀུན་ཏུ་གང་བར་མཛད་དོ།
en: All the blessed buddhas residing within the buddha realms in which a buddha was present then filled this entire buddha realm of Sahā with these utterances:

source: །ཤཱཀྱ་སེང་གེ་མི་ཡི་མཆོག །བྱམས་དང་ཐུགས་རྗེའི་རྒྱུ་འཐུན་པ།
en: “Lion of the Śākyas, supreme among humans, You are the outcome of love and compassion.

source: །སེམས་ཅན་ཀུན་ལ་ཕན་མཛད་པ།
en: You benefit all sentient beings

source: །བསོད་ནམས་ལས་གྲུབ་པ་ལ་ལྟོས།
en: And rely upon accomplishments based on merit.

source: །སེམས་ཅན་ཀུན་ལ་ཐུགས་བརྩེའི་ཕྱིར། །སངས་རྒྱས་སྤྱོད་ཡུལ་སྟོན་པར་མཛད། །ཐུགས་རྗེས་འོད་ཟེར་བཀྱེ་བས་ནི། །ཞིང་རྣམས་ཐམས་ཅད་གསལ་བར་གྱུར། །
en: “You display the domain of the buddhas Out of affection for all sentient beings, And you illuminate all the realms With the light of your compassion.

source: རེ་རེས་ཞིང་ནི་རྒྱས་གྱུར་པ། །གནས་ཀུན་གསལ་བ་མཐོང་ནས་སུ།
en: “Upon seeing all the vast realms Illuminated by that light,

source: །བྱང་ཆུབ་མཆོག་ནི་ཡོངས་ཚོལ་ཞིང་། །སེམས་ཀྱི་མཆོག་ཀྱང་སྐྱེད་པར་བྱེད།
en: Everyone pursues sublime awakening And gives rise to the supreme attitude.

source: །གང་དག་ལུས་ཅན་རྫུ་འཕྲུལ་འཐོབ། །དེ་དག་ཐམས་ཅད་མྱུར་དུ་ལྷགས།
en: “All those who have achieved miraculous powers Have quickly arrived.

source: །ཤཱཀྱ་སེང་གེ་མི་མཆོག་ལ། །ཁྱེད་ཀྱིས་བསྐོར་བ་བྱས་ནས་ཀྱང་།
en: Circumambulate the Lion of the Śākyas, Supreme among humans!

source: །གང་དག་རྫུ་འཕྲུལ་མ་ཐོབ་ཀུན།
en: “All those who have not developed miraculous powers

source: །རྒྱང་མ་ནས་ནི་ཕྱག་འཚོལ་ལ།
en: Should pay homage to him from afar.

source: །བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དང་། །མི་ཡི་སྐྱེས་མཆོག་རྣམས་སུ་འགྱུར།
en: Give rise to the mind set on awakening, And become the best among humans!”

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་རང་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་ནས་དབྱངས་ཀྱིས་གོ་བར་མཛད་ནས། ཐུགས་རྗེའི་དབང་གིས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་མཛད་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པའི་དགོངས་པ་དང་སྨོན་ལམ་ཡོངས་སུ་བསྐང་བའི་ཕྱིར་དང་། དེའི་ཡོན་ཏན་བརྗོད་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་རེ་རེ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་དང་། དེ་བཞིན་དུ་ཉན་ཐོས་ཆེན་པོ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཕྲག་དུ་མ་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། དྲི་ཟ་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཕྲག་དུ་མས་མདུན་དུ་བདར་ཅིང་ཡོངས་སུ་བསྐོར་ཏེ། དེ་དག་རང་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་ནས་རྫུ་འཕྲུལ་གྱིས་ཡང་དག་པར་ཞུགས་ནས་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་འདིར་གཤེགས་ཏེ།
en: When the blessed buddhas had uttered this statement from their respective buddha realms, each of those thus-gone ones—attended and surrounded by bodhisattvas, great hearers, gods, nāgas, yakṣas, asuras, garuḍas, gandharvas, kinnaras, and mahoragas several times as numerous as the grains of sand of the Ganges—left their buddha realms and miraculously arrived in this buddha realm of Sahā to ripen sentient beings through the power of their compassion, to fulfill the intent and the aspiration of the thus-gone Śākyamuni, and to proclaim his qualities.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་ལ་ལན་གསུམ་བསྐོར་བ་མཛད་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་འཁོར་གྱི་སེམས་ཅན་གང་དག་ཡིན་པ་དེ་དག་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ལ་སྐོར་བ་བྱེད་ཅིང་དེ་ལྟ་བུའི་མཆོད་པ་བྱེད་པར་གྱུར་ཏོ།
en: Upon arriving, they circumambulated the body of the Blessed One three times. The beings present in the retinues of those blessed buddhas also circumambulated the blessed thus-gone Śākyamuni and engaged in acts of worship.

source: །ཡང་རང་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་དག་ཏུ་ཡང་དོང་ངོ་།
en: After that, they returned to their respective buddha realms.

source: །དེའི་དུས་ན་སེམས་ཅན་གང་དག་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དུ་བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་ལ་ཆུད་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཕྱོགས་བཅུ་ཀུན་གྱི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་བཀོད་པའི་དེ་བཞིན་གཤེགས་པ་འཁོར་དང་བཅས་པ་རྣམས་མཐོང་ངོ་།
en: At that time, those beings in the buddha realm of Sahā who were present within the body of the Blessed One saw those thus-gone ones residing with their retinues amid the arrays of qualities of all the buddha realms of the ten directions.

source: །དེ་དག་ཐམས་ཅད་ཀྱིས་དེ་ནས་ཡང་དག་པར་ཞུགས་པ་འཁོར་དང་བཅས་པ་རྣམས་དང་། བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ལ་བསྐོར་བ་མཛད་ཅིང་གཤེགས་པ་དང་། རང་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འཇུག་ཅིང་རྡོ་རྗེའི་གདན་ལ་བཞུགས་ཏེ་ཆོས་སྟོན་པ་མཐོང་ངོ་།
en: They saw them arriving from those places with their retinues, circumambulating the blessed Śākyamuni, departing, reentering their respective buddha realms, sitting at the Vajra Seat, and teaching the Dharma.

source: །ཇི་ལྟར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་རང་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་དག་ཏུ་རང་རང་གི་གདན་ལ་བཞུགས་ནས་རང་རང་གི་འཁོར་ལས་བརྩམས་ཏེ། དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པའི་བསྔགས་པ་དང་། ཡོན་ཏན་དང་། གྲགས་པ་དང་། ཤེས་རབ་དང་། བསོད་ནམས་དང་། བརྩོན་འགྲུས་དང་། ཐུགས་རྗེ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་མཛད་པ་བསྟན་པ་བཞིན་དེར་སངས་རྒྱས་ཀྱི་ཞིང་རེ་རེར་ཡང་སེམས་ཅན་གྲངས་མེད་དཔག་ཏུ་མེད་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་གྱུར་ཏོ། །རང་རང་གི་ལུང་བསྟན་པ་ཐོབ་པར་གྱུར་ཏོ།
en: In each of those buddha realms, as those blessed buddhas were sitting at their seats while teaching their respective retinues about the thus-gone Śākyamuni’s praises, qualities, fame, insight, merit, diligence, compassion, and ripening of sentient beings, an innumerable and limitless number of beings—as many as the grains of sand in the Ganges—gave rise to the mind set on unsurpassed and perfect awakening and received individual prophecies.

source: །རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་ཡང་དེ་བཞིན་ནོ། །ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་ཡང་དེ་བཞིན་ནོ།
en: Others did the same with respect to the vehicles of the hearers and the solitary buddhas.

source: །འདིར་བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་ལ་ཆུད་པ་གང་དག་ཡིན་པ་ཐམས་ཅད་ཀྱིས་ཀྱང་མཐོང་ངོ་། །ལུང་བསྟན་པ་ཡང་ཐམས་ཅད་ཀྱིས་ཐོས་སོ།
en: All the beings present within the body of the Blessed One witnessed this and heard those prophecies.

source: །སྙིགས་མ་ལྔའི་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་པ་དག་ན་སེམས་ཅན་གང་དག་ཡོད་པའི་བདེ་བ་དང་སྡུག་བསྔལ་གྱི་ཚོར་བ་ཅི་འདྲ་བ་མྱོང་བ་དག་ཀྱང་འདིར་བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་ལ་ཆུད་ཅིང་འཁོད་པ་རྣམས་ཀྱིས་མཐོང་ངོ་།
en: All of those beings who were sitting within the body of the Blessed One also perceived the different feelings of happiness and suffering experienced by the sentient beings who lived in empty buddha realms ripe with the five degenerations.

source: །དེའི་ཚེ་སྙིགས་མ་ལྔའི་འཇིག་རྟེན་གྱི་ཁམས་སྟོང་པ་དག་ན་སེམས་ཅན་གང་དག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་སྣང་བ་དེ་མཐོང་ནས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ཡང་མཐོང་སྟེ།
en: At that time, all those who lived in those empty universes ripe with the five degenerations also perceived that light, and they saw the thus-gone Śākyamuni.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་བགྲང་བ་ལས་འདས་པ་དང་། དེ་བཞིན་གཤེགས་པ་རེ་རེ་ཡང་སེམས་ཅན་བགྲང་བ་ལས་འདས་པ་དག་དང་ཐབས་ཅིག་ཏུ་འདིར་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ལ་བསྐོར་བ་མཛད་པ་མཐོང་ངོ་།
en: They saw those countless blessed buddhas and the countless beings who accompanied each of those thus-gone ones circumambulating the thus-gone Śākyamuni within this world.

source: །དེའི་ཚེ་སེམས་ཅན་དེ་དག་ཐམས་ཅད་མཆོག་ཏུ་དགའ་བའི་དམ་པ་སྐྱེས་ཏེ། ཐམས་ཅད་སྡུག་བསྔལ་གྱི་ཚོར་བ་རྒྱུན་ཆད་དོ།
en: At that moment, all those beings experienced sublime joy, and their feelings of suffering disappeared.

source: །སྙིགས་མ་ལྔའི་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་པ་དེ་དག་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ས་བཅུ་པ་གང་དག་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་གང་ན་སངས་རྒྱས་ཀྱིས་འདུལ་བའི་སེམས་ཅན་དག་ཡོད་པ་དེར་སངས་རྒྱས་ཀྱི་སྐུ་བྱད་ཀྱིས་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་ཐམས་ཅད་དབྱངས་དང་། ངག་དང་། སྒྲ་བརྗོད་པ་གཅིག་གིས་གོ་བར་མཛད་དོ།
en: Tenth-level bodhisattva great beings entered those empty buddha realms ripe with the five degenerations to ripen these sentient beings. In buddha realms with beings to be tamed by buddhas, they assumed the appearance of buddhas and spoke of the buddha realm of Sahā in a single voice, a single utterance, and a single sound:

source: །དགེ་བའི་དོན་དུ་ཞིང་གཅིག་ཏུ། །ངེད་ཅག་ཐམས་ཅད་གཤེགས་པ་ཡིན།
en: “We have all come To one realm for the sake of virtue.

source: །སངས་རྒྱས་རྣམས་ནི་མི་བཞུགས་ན།
en: If no buddhas reside within a world,

source: །སུས་ཀྱང་དཔལ་ཆེན་མི་འཐོབ་བོ།
en: No one will achieve great glory.

source: །ཁྱེད་ཅག་གིས་ནི་བྱང་ཆུབ་ཏུ། །གཅིག་ཏུ་སེམས་ནི་གཞོལ་བྱས་ན།
en: “If you solely dedicate yourself To the mind set on awakening,

source: །ཁྱེད་ཅག་ཕྱིན་ཅད་འཁོར་བར་ནི། །སྡུག་བསྔལ་སྐྱེ་བར་མི་འགྱུར་རོ།
en: You will no longer experience Suffering in saṃsāra.

source: །ཤཱཀྱ་ཁྱུ་མཆོག་མཆོད་པ་དང་། །དེ་ལ་བསྐོར་བ་བྱ་བའི་ཕྱིར། །འདི་ལྟར་ཁྱེད་ཅག་ཐམས་ཅད་ནི། །ང་དང་ཐབས་ཅིག་མྱུར་དུ་འདེང་།། །།
en: “All of you, quickly depart with us To worship Śākyamuni—The foremost among humans—And to circumambulate him!”

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ཀྱང་སངས་རྒྱས་ཀྱི་སྐུ་བྱད་ཀྱིས་རེ་རེ་ཞིང་སེམས་ཅན་རྫུ་འཕྲུལ་དང་ལྡན་པ་གང་གཱའི་ཀླུང་གཅིག་གི་བྱེ་མ་སྙེད་དང་ལྷན་ཅིག་ཏུ་དེ་ནས་ཆས་ཏེ།
en: Those bodhisattva great beings, appearing like buddhas and accompanied by sentient beings possessing miraculous powers who were as numerous as the grains of sand in the Ganges, then left those realms.

source: དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ལ་སེམས་ཅན་དེ་དག་གིས་རིན་པོ་ཆེ་སྣ་ཚོགས་ནས་རོལ་མོའི་སྒྲ་དང་། གར་དང་གླུ་སྣ་ཚོགས་པའི་བར་གྱིས་མཆོད་པ་བྱས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་བཏབ་བོ།
en: They circumambulated the thus-gone Śākyamuni three times, worshiped the Blessed One with music from instruments made of precious gems and with different dances and songs, and then formed the aspiration to attain unsurpassed and perfect awakening.

source: །ཁ་ཅིག་གིས་ནི་རྐྱེན་གྱི་ཐེག་པར་སྨོན་ལམ་བཏབ། ཁ་ཅིག་གིས་ནི་ཉན་ཐོས་ཀྱི་ཐེག་པར་སྨོན་ལམ་བཏབ་སྟེ།
en: Some aspired for the vehicle of conditions, some for the vehicle of the hearers.

source: ཐམས་ཅད་ཀྱང་བསམས་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ།
en: All of them reached the level of nonregression in accordance with their individual inclinations.

source: །དེའི་ཚེ་དེ་དག་ཆོ་ག་བཞིན་དུ་ཏིང་ངེ་འཛིན་དང་། བཟོད་པ་དང་། གཟུངས་ཐོབ་སྟེ།
en: At that time, they reached different levels of absorption, acceptance, and recall in accordance with their individual practices.

source: དགེ་བའི་རྩ་བ་རྣམ་པ་སྣ་ཚོགས་བསྒྲུབས་ནས་རང་གི་ཞིང་དུ་དོང་སྟེ།
en: Then, after having accomplished a variety of roots of virtues, they returned to their respective realms.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཁ་ཅིག་ནི་རང་རྒྱལ་བའི་ལུས་བྱད་ཀྱིས་ཞེས་བྱ་བ་ནས་ཁ་ཅིག་ནི་ཉན་ཐོས་ཀྱི་ལུས་བྱད་ཀྱིས་ཞེས་བྱ་བའི་བར་དང་། ཁ་ཅིག་ནི་ཚངས་པའི་ལུས་བྱད་དང་། ཁ་ཅིག་ནི་བརྒྱ་བྱིན་གྱི་ལུས་བྱད་ཀྱིས་ཞེས་བྱ་བ་ནས་ཁ་ཅིག་ནི་རྒྱལ་པོ་ཆེན་པོ་བཞིའི་ལུས་བྱད་ཀྱིས་ཞེས་བྱ་བའི་བར་དང་། ཁ་ཅིག་ནི་སྲེད་མེད་ཀྱི་བུའི་ལུས་བྱད་དང་། ཁ་ཅིག་ནི་དབང་ཕྱུག་ཆེན་པོའི་ལུས་བྱད་ཀྱིས་ཞེས་བྱ་བའི་བར་དང་། ཁ་ཅིག་ནི་ཀླུའི་ལུས་བྱད་ཀྱིས་ཞེས་བྱ་བའི་བར་དང་། ཁ་ཅིག་ནི་གནོད་སྦྱིན་གྱི་ལུས་བྱད་ཀྱིས་ཞེས་བྱ་བའི་བར་དང་། ཁ་ཅིག་ནི་ལྷ་མ་ཡིན་གྱི་ལུས་བྱད་ཀྱིས་ཞེས་བྱ་བའི་བར་དང་། ཁ་ཅིག་ནི་འཁོར་ལོས་སྒྱུར་བའི་ལུས་བྱད་ཀྱིས་ཞེས་བྱ་བའི་བར་གྱིས་སངས་རྒྱས་ཀྱི་ཞིང་གང་དག་ན་སེམས་ཅན་ཉན་ཐོས་ཀྱིས་འདུལ་བའི་བར་དུ་ཡོད་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ས་བཅུ་པ་རྣམས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ཞུགས་ཏེ།
en: Some tenth–level bodhisattva great beings assumed the appearance of solitary buddhas, and some others took on the appearances of hearers, Brahmā, Śakra, the Four Great Kings, Nārāyaṇa, Maheśvara, nāgas, yakṣas, asuras, and universal monarchs. To ripen sentient beings, they then entered buddha realms where there were sentient beings to be tamed by hearers.

source: དེར་ཉན་ཐོས་ཀྱི་ལུས་བྱད་ཀྱི་བར་གྱིས་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏོ།
en: There, they taught the Dharma to sentient beings while assuming the appearance of hearers.

source: །སངས་རྒྱས་ཀྱི་ཞིང་དེར་ཡང་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་སྣང་བ་དེ་མཐོང་སྟེ།
en: Everyone in those buddha realms perceived that light as well as the thus-gone Śākyamuni.

source: དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ཡང་མཐོང་ནས་སེམས་ཅན་དེ་དག་ཤིན་ཏུ་དགའ་བ་དང་མཆོག་ཏུ་དགའ་བ་སྐྱེས་ཤིང་དབང་པོ་རྣམས་ཚིམ་སྟེ། ཐམས་ཅད་སྡུག་བསྔལ་གྱི་ཚོར་བ་རྒྱུན་ཆད་དོ། །དེ་དག་ལ་བདེ་བའི་ཚོར་བ་ཡང་བྱུང་ངོ་།
en: They were filled with intense joy and delight, their senses were satisfied, their feelings of suffering disappeared, and they experienced feelings of happiness.

source: །སངས་རྒྱས་ཀྱི་ཞིང་དེར་གང་ཉན་ཐོས་ཀྱི་ལུས་བྱད་ཀྱིས་ཆོས་སྟོན་པ་དེ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡིན་ཏེ།
en: Those who taught the Dharma in those buddha realms in the appearance of hearers were in fact bodhisattva great beings.

source: དེས་བསོད་ནམས་ཆེན་པོ་བསགས་པའི་དགེ་བའི་རྩ་བས་འདི་ལྟ་བུའི་དབྱངས་དང་སྒྲ་བརྗོད་པས་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ཐམས་ཅད་གོ་བར་བྱེད་པ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Through the roots of virtue created by the accumulation of great merit, they spoke of the buddha realm of Sahā in this melodious utterance:

source: །སྡིག་པའི་སེམས་ནི་གཞོམ་པར་བྱོས།
en: “Overcome inclinations toward negative actions

source: །སྡིག་པའི་ལྟ་བ་སྤོང་བར་བྱོས། །གང་དུ་འཇིག་རྟེན་མི་འཇུག་པའི། །འཁོར་བའི་ཕ་རོལ་འདོང་བར་བྱོས།
en: And abandon evil views! Go beyond saṃsāra, To where there is no involvement with the world!

source: །ཁྱེད་ཅག་སྡིག་པའི་སེམས་ཀྱིས་སུ།
en: “If you are inclined toward negative actions

source: །ངེས་པར་འབྱུང་བར་མི་ལྟ་བས།
en: You will disregard emancipation.

source: །རྒ་བ་དང་ནི་འཆི་བའི་ལུས།
en: Thus, this body that undergoes old age and death

source: །འཁོར་བར་རིང་པོར་ཞུགས་པ་ཡིན།
en: Has remained in saṃsāra for a long time.

source: །སྟོན་པ་མཐོང་བ་རྙེད་པར་དཀའ།
en: “It is rare to behold the Teacher,

source: །དལ་བ་འདི་འདྲ་རྙེད་པར་དཀའ།
en: It is rare to find such freedoms as these,

source: །ཆོས་ཐོས་པ་ཡང་རྙེད་པར་དཀའ།
en: It is rare to hear the Dharma,

source: །དགེ་བྱེད་རབ་ཏུ་རྙེད་པར་དཀའ།
en: And it is extremely rare to perform virtuous actions.

source: །དེ་ལྟར་ཁྱེད་ཀྱིས་གུས་བྱས་ཏེ།
en: “Therefore, eagerly form

source: །བྱང་ཆུབ་ཏུ་ནི་འདུན་པ་སྐྱེད།
en: The aspiration to reach awakening.

source: །སྡུག་བསྔལ་ཀུན་ལས་ཐར་གྱིས་ལ།
en: Liberate yourselves from all forms of suffering

source: །འཇིག་རྟེན་འདྲེན་པར་འགྱུར་བར་བྱོས།
en: And become guides in the world!

source: །རྟག་པ་དང་ནི་ཆད་པའི་བློས། །ཆོས་གཉིས་མྱུར་དུ་སྤངས་ནས་ནི། །འདུ་བྱེད་ཐམས་ཅད་བདག་མེད་ལ། །ཚུལ་བཞིན་དུ་ནི་རྟག་པར་བྱོས།
en: “Quickly abandon The views of permanence and nihilism, And investigate correctly The selflessness of all formations!

source: །ཀུན་འབྱུང་སྲེད་དང་སྡུག་བསྔལ་ཡང་།
en: “Wash away suffering and its origin, craving,

source: །ཡེ་ཤེས་ཆུ་ཡིས་བཀྲུ་བར་བྱོས། །ཤཱཀྱ་སེང་གེ་མཆོད་པའི་ཕྱིར། །ཐམས་ཅད་ལྷན་ཅིག་མྱུར་དུ་འདོང་།
en: With the water of wisdom And quickly depart all together To worship the Lion of the Śākyas!”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཉན་ཐོས་ཀྱི་ལུས་བྱད་ཀྱི་བར་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་རེ་རེ་ཞིང་བྱང་ཆུབ་སེམས་དཔའ་དང་། སེམས་ཅན་རྫུ་འཕྲུལ་དང་ལྡན་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཚད་མེད་པ་དང་ལྷན་ཅིག་ཏུ་རང་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་ནས་ཆས་ཏེ།
en: Those bodhisattva great beings, appearing like hearers and accompanied by sentient beings possessing miraculous powers who were as numerous as the grains of sand in the Ganges, then left those realms.

source: འདིར་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་འཁོར་དང་བཅས་པ་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ལ་དེ་དག་གིས་རིན་པོ་ཆེ་སྣ་ཚོགས་དང་། རས་བཅོས་བུ་སྣ་ཚོགས་དང་། ཆོས་གོས་སྣ་ཚོགས་དང་། རྒྱན་དང་རྒྱན་གྱི་ལྷབ་ལྷུབ་སྣ་ཚོགས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་སྣ་ཚོགས་དང་། མེ་ཏོག་སྣ་ཚོགས་དང་། སྤོས་སྣ་ཚོགས་དང་། རོལ་མོའི་སྒྲ་སྣ་ཚོགས་དང་། བསྟོད་པ་སྣ་ཚོགས་དང་། གླུ་སྣ་ཚོགས་དང་། གར་སྣ་ཚོགས་ཀྱིས་མཆོད་པ་བྱས་སོ།
en: In this world, they circumambulated the thus-gone Śākyamuni and his retinue three times and worshiped the Blessed One by offering him a variety of precious gems, fine cotton cloths, Dharma robes, jewelry, ornaments, parasols, banners, flags, flowers, perfumes, music, praise, song, and dance.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་རང་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་ཕྱིན་ནས་རང་རང་གི་སྟན་དག་ལ་འཁོད་དོ།
en: When they arrived back in their respective buddha realms, those bodhisattva great beings sat back on their seats.

source: །དེ་བཞིན་དུ་རང་རང་གི་འཁོར་རྣམས་ལ་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པའི་བསྔགས་པ་དང་གྲགས་པ་ནས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་མཛད་པའི་ཡོན་ཏན་གྱི་ཕན་ཡོན་གྱི་བར་བརྗོད་པར་གྱུར་ཏེ།
en: In the same way, they proclaimed to their individual retinues the praises and the fame of the thus-gone Śākyamuni [. . .] and the virtuous qualities of his activity of ripening all beings.

source: དེ་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ན་འཁོར་དེའི་སེམས་ཅན་གྲངས་མེད་པ་དཔག་ཏུ་མེད་པ་ཡོད་པ་དེ་དག་གིས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ།
en: In those buddha realms, the innumerable and limitless numbers of sentient beings present in these retinues gave rise to the mind set on unsurpassed and perfect awakening.

source: །དེ་བཞིན་དུ་ཉན་ཐོས་ཀྱི་ཐེག་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པར་ཡང་སེམས་བསྐྱེད་དེ།
en: Likewise, some gave rise to the mind set on the vehicles of the hearers and the solitary buddhas.

source: ཐམས་ཅད་ཀྱང་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ།
en: All of them reached the level of nonregression.

source: །དེའི་ཚེ་དེ་དག་གིས་ཏིང་ངེ་འཛིན་དང་། གཟུངས་དང་། བཟོད་པ་སྣ་ཚོགས་ཐོབ་ནས་དགེ་བའི་རྩ་བ་རྣམས་བསྐྱེད་དོ།
en: At that time, they reached various levels of absorption, recall, and acceptance, and they created roots of virtue.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱིས་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་འདིར་གང་བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་ལ་ཆུད་པར་གྱུར་པའི་བཀོད་པ་དེ་ལྟ་བུ་ཡང་མཐོང་ངོ་།
en: All sentient beings also saw, in this buddha realm of Sahā, the array present in the body of the Blessed One.

source: །དེ་དག་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་རྣམས་ལ་ངོ་མཚར་ཐོབ་ཅིང་རྨད་དུ་བྱུང་བ་ཐོབ་བོ།
en: They were all amazed and astonished by the qualities of the Thus-Gone One.

source: །དེའི་ཚེ་གང་དག་སྔོན་ཆད་སེམས་མ་བསྐྱེད་པའི་སེམས་ཅན་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་གྲངས་མེད་པ་དཔག་ཏུ་མེད་པ་དེ་དག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་གྱུར་ཏོ།
en: At that moment, those sentient beings—innumerable and limitless as the grains of sand of the Ganges—who had not yet given rise to the mind set on unsurpassed and perfect awakening gave rise to it.

source: །དེ་བཞིན་དུ་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་དང་། དེ་བཞིན་དུ་ཉན་ཐོས་ཀྱི་ཐེག་པར་ཡང་སེམས་དག་བསྐྱེད་དེ། དེ་དག་ཐམས་ཅད་ཕྱིར་མི་ལྡོག་པའི་ས་ཐོབ་པར་གྱུར་ཏོ།
en: Similarly, some gave rise to the mind set on the vehicles of the solitary buddhas and the hearers, and they all reached the level of nonregression.

source: །དེ་བཞིན་དུ་འཁོར་ལོས་སྒྱུར་བའི་ལུས་བྱད་ཀྱིས་ཞེས་བྱ་བའི་བར་དང་། ཕྱིར་མི་ལྡོག་པའི་ས་ཐོབ་པར་གྱུར་ཏོ་ཞེས་བྱ་བའི་བར་དུ་ཡིན་ཏེ།
en: The same happened with respect to all those who assumed the other appearances—up to those who appeared as universal monarchs—all the way to their attainment of the level of nonregression.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་མཛད་པའི་ཕྱིར་ཇི་ལྟར་བཅོམ་ལྡན་འདས་ཆོ་འཕྲུལ་ཆེན་པོ་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡུལ་གྱི་རྒྱུ་འཐུན་པར་ཏིང་ངེ་འཛིན་དེ་ལྟ་བུ་ལ་སྙོམས་པར་ཞུགས་པ་བཞིན་ནོ།
en: This is how the Blessed One, who is endowed with great miraculous powers, rested in equipoise in the absorption that stems from the domain of all buddhas, in order to ripen all beings.

source: །འདུས་པ་ཆེན་པོ་ཉི་མའི་སྙིང་པོའི་ལེའུ་བཅུ་གཅིག་པ་ལས་ལེའུ་དྲུག་པའོ།། །།
en: This concludes the sixth among the eleven chapters in “The Quintessence of the Sun” of The Great Assembly.

source: དེ་ནས་བདུད་སྡིག་ཅན་གྱིས་དེ་བཞིན་གཤེགས་པ་འཁོར་དང་བཅས་པ་ཉིད་ཀྱི་ཕོ་བྲང་ན་དེ་བཞིན་གཤེགས་པའི་དབྱིངས་ན་བཞུགས་པ་མཐོང་ནས་མཆོག་ཏུ་ཡིད་མི་བདེ་སྟེ་ལུས་ཐམས་ཅད་ནས་རྡུལ་འཐོན་ཞིང་མཆི་མ་དག་བྱུང་ནས་མི་དགའ་བར་གྱུར་ཏོ། །
en: When the evil Māra saw all these thus-gone ones and retinues in their respective palaces present within the body of the Thus-Gone One, he became extremely unhappy. Dirt emerged from his entire body, and he began to weep out of distress.

source: དེ་ནས་བདུད་སྡིག་ཅན་གྱིས་གནས་ཐམས་ཅད་དུ་རྒྱུ་བར་བྱེད། །རྣམ་པར་རྒྱུ་བར་བྱེད། འཇུག་པར་བྱེད། འབྱུང་བར་བྱེད། ལྡང་བར་བྱེད། རྒྱུག་པར་བྱེད། ཀུན་ཏུ་རྒྱུག་པར་བྱེད། གླལ་བར་བྱེད། འཛུམ་པར་བྱེད། ཤུགས་རིང་དུ་འབྱིན་པར་བྱེད། ཁ་ལ་ལྕེས་ལྡག་པར་བྱེད། མིག་འཛུམས་པར་བྱེད། ལག་པ་གཉིས་རྐྱོང་ཞིང་སྐུམ་པར་བྱེད། མགོ་ལ་ལག་པ་གཉིས་ཀྱིས་རྡོབ་པར་བྱེད། མགྲིན་པ་དང་ནུ་མ་ལ་མཉེད་པར་བྱེད་དེ།
en: He started to run to and fro, to leave only to reappear, and to jump up, run and race around, gape, laugh, sigh, lick his mouth, close his eyes, stretch and contract his arms, rest his head in his hands, and rub his throat and breast.

source: དེ་མཐོང་བས་བདུད་ཀྱི་གནས་ན་གནས་པའི་སེམས་ཅན་ཐམས་ཅད་གནོད་པ་དང་། མངོན་པར་མི་དགའ་བ་དང་། ཡིད་མི་བདེ་བར་གྱུར་ཏོ།
en: When they saw this, all the sentient beings residing in the abode of Māra were unsettled. They became displeased and unhappy.
